## 학생들 실습

### 첫번째 예제

In [1]:
import pandas as pd

In [3]:
data = {
    "홍길동":[88,75,95],
    "강감찬":[82,62,85],
    "김종민":[75,69,70],
    "임창정":[45,56,80]
}
df = pd.DataFrame(data, index=['java','python','basic'])
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   80

In [4]:
# 홍길동 학생의 과목별 점수를 출력하시오

df["홍길동"]

java      88
python    75
basic     95
Name: 홍길동, dtype: int64

In [5]:
# python 과목의 점수를 출력하시오.

df.loc["python"]

홍길동    75
강감찬    62
김종민    69
임창정    56
Name: python, dtype: int64

In [8]:
# 임창정 학생의 basic 점수를 78로 수정하시오.

df.loc["basic","임창정"] = 78   # df.iloc[2,3] = 80
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78

In [9]:
# 각 학생의 sql 점수를 추가하시오 [70,85,86,92]

df.loc["sql"] = [70,85,86,92]
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
basic    95   85   70   78
sql      70   85   86   92

In [11]:
# basic 점수를 삭제하시오

df.drop("basic",inplace=True)
df

        홍길동  강감찬  김종민  임창정
java     88   82   75   45
python   75   62   69   56
sql      70   85   86   92

### 두 번째 예제

In [2]:
df = pd.DataFrame({"미국":[2.1,2.2,2.3], "한국":[0.4,0.5,0.45], "중국":[10,13,15]})
df

    미국    한국  중국
0  2.1  0.40  10
1  2.2  0.50  13
2  2.3  0.45  15

In [5]:
# 인덱스와 함께 생성하기

df = pd.DataFrame({"미국":[2.1,2.2,2.3], "한국":[0.4,0.5,0.45], "중국":[10,13,15]}, index=[2019,2020,2021])
df

       미국    한국  중국
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

In [6]:
#  인덱스를 출력하시오

df.index

Int64Index([2019, 2020, 2021], dtype='int64')

In [7]:
# 컬럼명을 출력하시오.

df.columns

Index(['미국', '한국', '중국'], dtype='object')

In [8]:
# 전체 값들만 출력하기

df.values

array([[ 2.1 ,  0.4 , 10.  ],
       [ 2.2 ,  0.5 , 13.  ],
       [ 2.3 ,  0.45, 15.  ]])

In [9]:
# 인덱스로 특정 컬럼 선택하기

df["미국"]

2019    2.1
2020    2.2
2021    2.3
Name: 미국, dtype: float64

In [11]:
df.미국   #  이 경우는 안될수도 있음

2019    2.1
2020    2.2
2021    2.3
Name: 미국, dtype: float64

In [20]:
df = pd.DataFrame({"년도":[2019,2020,2021],"미국":[2.1,2.2,2.3], "한국":[0.4,0.5,0.45], "중국":[10,13,15]})
df

     년도   미국    한국  중국
0  2019  2.1  0.40  10
1  2020  2.2  0.50  13
2  2021  2.3  0.45  15

In [23]:
# 년도를 index로 생성하기

df = df.set_index("년도")
df

       미국    한국  중국
년도
2019  2.1  0.40  10
2020  2.2  0.50  13
2021  2.3  0.45  15

In [24]:
# 인덱스를 컬럼으로 변경하기

df = df.reset_index('년도')
df

     년도   미국    한국  중국
0  2019  2.1  0.40  10
1  2020  2.2  0.50  13
2  2021  2.3  0.45  15

In [25]:
# 2020년 특정행 가져오기

df.iloc[1]

년도    2020.0
미국       2.2
한국       0.5
중국      13.0
Name: 1, dtype: float64

In [27]:
# index 명으로 가져오기

df.loc[1]

년도    2020.0
미국       2.2
한국       0.5
중국      13.0
Name: 1, dtype: float64

In [28]:
# 일본 컬럼 추가하기

df["일본"] = [3,4,5]
df

     년도   미국    한국  중국  일본
0  2019  2.1  0.40  10   3
1  2020  2.2  0.50  13   4
2  2021  2.3  0.45  15   5